log/64k/64k.out
seqwrites64k: (g=0): rw=write, bs=64K-64K/64K-64K/64K-64K, ioengine=libaio, iodepth=64
seqread64k: (g=1): rw=read, bs=64K-64K/64K-64K/64K-64K, ioengine=libaio, iodepth=64
randwrite64k: (g=2): rw=randwrite, bs=64K-64K/64K-64K/64K-64K, ioengine=libaio, iodepth=64
randread64k: (g=3): rw=randread, bs=64K-64K/64K-64K/64K-64K, ioengine=libaio, iodepth=64
randrw64k: (g=4): rw=randread, bs=64K-64K/64K-64K/64K-64K, ioengine=libaio, iodepth=64
fio-2.1.11
Starting 5 threads
seqwrites64k: Laying out IO file(s) (1 file(s) / 2048MB)
seqread64k: Laying out IO file(s) (1 file(s) / 2048MB)
randwrite64k: Laying out IO file(s) (1 file(s) / 2048MB)
randread64k: Laying out IO file(s) (1 file(s) / 2048MB)
randrw64k: Laying out IO file(s) (1 file(s) / 2048MB)

seqwrites64k: (groupid=0, jobs=1): err= 0: pid=10300: Tue May 16 12:56:34 2017
  write: io=2048.0MB, bw=112363KB/s, iops=1755, runt= 18664msec
    slat (usec): min=7, max=49442, avg=27.08, stdev=419.57
    clat (msec): min=2, max=128, avg=36.42, stdev=15.89
     lat (msec): min=2, max=128, avg=36.45, stdev=15.90
    clat percentiles (msec):
     |  1.00th=[    8],  5.00th=[   14], 10.00th=[   20], 20.00th=[   26],
     | 30.00th=[   29], 40.00th=[   31], 50.00th=[   34], 60.00th=[   37],
     | 70.00th=[   42], 80.00th=[   48], 90.00th=[   58], 95.00th=[   68],
     | 99.00th=[   87], 99.50th=[   95], 99.90th=[  109], 99.95th=[  121],
     | 99.99th=[  127]
    bw (KB  /s): min=103780, max=119168, per=100.00%, avg=112458.73, stdev=3174.35
    lat (msec) : 4=0.04%, 10=2.44%, 20=8.86%, 50=71.20%, 100=17.18%
    lat (msec) : 250=0.28%
  cpu          : usr=1.89%, sys=5.06%, ctx=28332, majf=0, minf=686
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=0/w=32768/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=64
seqread64k: (groupid=1, jobs=1): err= 0: pid=10301: Tue May 16 12:56:34 2017
  read : io=2048.0MB, bw=155391KB/s, iops=2427, runt= 13496msec
    slat (usec): min=7, max=236, avg=13.99, stdev= 5.77
    clat (msec): min=1, max=222, avg=26.34, stdev=15.90
     lat (msec): min=1, max=222, avg=26.35, stdev=15.90
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    6], 10.00th=[    8], 20.00th=[   13],
     | 30.00th=[   18], 40.00th=[   23], 50.00th=[   28], 60.00th=[   32],
     | 70.00th=[   34], 80.00th=[   36], 90.00th=[   38], 95.00th=[   46],
     | 99.00th=[   90], 99.50th=[  100], 99.90th=[  117], 99.95th=[  198],
     | 99.99th=[  219]
    bw (KB  /s): min=100608, max=174976, per=100.00%, avg=155852.31, stdev=22630.73
    lat (msec) : 2=0.13%, 4=2.36%, 10=12.43%, 20=19.47%, 50=61.18%
    lat (msec) : 100=3.92%, 250=0.50%
  cpu          : usr=0.71%, sys=4.65%, ctx=6404, majf=0, minf=1702
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=64
randwrite64k: (groupid=2, jobs=1): err= 0: pid=10302: Tue May 16 12:56:34 2017
  write: io=2048.0MB, bw=77690KB/s, iops=1213, runt= 26994msec
    slat (usec): min=10, max=21483, avg=20.84, stdev=152.51
    clat (msec): min=2, max=720, avg=52.70, stdev=40.62
     lat (msec): min=2, max=720, avg=52.72, stdev=40.61
    clat percentiles (msec):
     |  1.00th=[   13],  5.00th=[   22], 10.00th=[   27], 20.00th=[   33],
     | 30.00th=[   37], 40.00th=[   41], 50.00th=[   45], 60.00th=[   48],
     | 70.00th=[   52], 80.00th=[   61], 90.00th=[   85], 95.00th=[  110],
     | 99.00th=[  229], 99.50th=[  310], 99.90th=[  469], 99.95th=[  523],
     | 99.99th=[  644]
    bw (KB  /s): min=68426, max=110695, per=99.96%, avg=77661.26, stdev=6335.93
    lat (msec) : 4=0.01%, 10=0.41%, 20=3.56%, 50=62.32%, 100=27.38%
    lat (msec) : 250=5.48%, 500=0.76%, 750=0.07%
  cpu          : usr=0.90%, sys=2.24%, ctx=6462, majf=0, minf=21
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=0/w=32768/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=64
randread64k: (groupid=3, jobs=1): err= 0: pid=10303: Tue May 16 12:56:34 2017
  read : io=2048.0MB, bw=150366KB/s, iops=2349, runt= 13947msec
    slat (usec): min=10, max=671, avg=16.07, stdev= 9.13
    clat (msec): min=1, max=204, avg=27.22, stdev=18.74
     lat (msec): min=1, max=204, avg=27.23, stdev=18.74
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    6], 10.00th=[    8], 20.00th=[   13],
     | 30.00th=[   18], 40.00th=[   23], 50.00th=[   28], 60.00th=[   31],
     | 70.00th=[   34], 80.00th=[   36], 90.00th=[   41], 95.00th=[   53],
     | 99.00th=[  102], 99.50th=[  141], 99.90th=[  165], 99.95th=[  172],
     | 99.99th=[  194]
    bw (KB  /s): min=103040, max=171392, per=100.00%, avg=151432.22, stdev=19571.22
    lat (msec) : 2=0.15%, 4=2.66%, 10=12.28%, 20=20.01%, 50=59.37%
    lat (msec) : 100=4.43%, 250=1.10%
  cpu          : usr=0.80%, sys=4.88%, ctx=6727, majf=0, minf=33
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=64
randrw64k: (groupid=4, jobs=1): err= 0: pid=10304: Tue May 16 12:56:34 2017
  read : io=2048.0MB, bw=155115KB/s, iops=2423, runt= 13520msec
    slat (usec): min=10, max=242, avg=13.46, stdev= 5.38
    clat (msec): min=1, max=163, avg=26.39, stdev=16.77
     lat (msec): min=1, max=163, avg=26.40, stdev=16.77
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    6], 10.00th=[    8], 20.00th=[   12],
     | 30.00th=[   17], 40.00th=[   22], 50.00th=[   27], 60.00th=[   31],
     | 70.00th=[   34], 80.00th=[   36], 90.00th=[   40], 95.00th=[   50],
     | 99.00th=[   93], 99.50th=[  113], 99.90th=[  145], 99.95th=[  153],
     | 99.99th=[  161]
    bw (KB  /s): min=124672, max=172621, per=99.79%, avg=154790.85, stdev=13772.65
    lat (msec) : 2=0.17%, 4=2.93%, 10=12.45%, 20=20.63%, 50=58.84%
    lat (msec) : 100=4.27%, 250=0.71%
  cpu          : usr=1.09%, sys=4.11%, ctx=6348, majf=0, minf=21
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: io=2048.0MB, aggrb=112363KB/s, minb=112363KB/s, maxb=112363KB/s, mint=18664msec, maxt=18664msec

Run status group 1 (all jobs):
   READ: io=2048.0MB, aggrb=155390KB/s, minb=155390KB/s, maxb=155390KB/s, mint=13496msec, maxt=13496msec

Run status group 2 (all jobs):
  WRITE: io=2048.0MB, aggrb=77689KB/s, minb=77689KB/s, maxb=77689KB/s, mint=26994msec, maxt=26994msec

Run status group 3 (all jobs):
   READ: io=2048.0MB, aggrb=150365KB/s, minb=150365KB/s, maxb=150365KB/s, mint=13947msec, maxt=13947msec

Run status group 4 (all jobs):
   READ: io=2048.0MB, aggrb=155114KB/s, minb=155114KB/s, maxb=155114KB/s, mint=13520msec, maxt=13520msec

Disk stats (read/write):
  sdb: ios=98142/65383, merge=91/211, ticks=2602020/2925432, in_queue=5528372, util=98.54%